tap "homebrew/bundle"
# GitHub command-line tool
brew "gh"
# Package manager for Microsoft development platform including .NET
brew "nuget"
# Fast, disk space efficient package manager
brew "pnpm"
# JavaScript package manager
brew "yarn"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Renamer for files, music and photos
cask "a-better-finder-rename"
# Application uninstaller
cask "appcleaner"
# Records audio from any application
cask "audio-hijack"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# App for building websites
cask "codekit"
# Configuration and network monitoring software
cask "devolo-cockpit"
# App to build and share containerised applications and microservices
cask "docker"
# Flip clock screensaver
cask "fliqlo"
# Change the behavior of the fn keys depending on the active application
cask "fluor"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Host-based application firewall
cask "little-snitch"
# Office suite
cask "microsoft-office"
# Mind Mapping Tool
cask "mindjet-mindmanager"
cask "phiewer"
# Translation editor
cask "poedit"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Web browser focusing on security
cask "tor-browser"
# Git client focusing on power and productivity
cask "tower"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# VPN client
cask "zenmate-vpn"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "cpylua.language-postcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dexxiez.shadcn-color-preview"
vscode "dline.cobaltnext"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evilz.vscode-reveal"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "inu1255.easy-snippet"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jnoortheen.nix-ide"
vscode "johnpapa.winteriscoming"
vscode "kamikillerto.vscode-colorize"
vscode "markosth09.color-picker"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.powershell"
vscode "mylesmurphy.prettify-ts"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "selemondev.vscode-shadcn-svelte"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "stordahl.sveltekit-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "usernamehw.errorlens"
vscode "wesbos.theme-cobalt2"
